---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.CouplerArray
source: html/5f807056-9beb-355c-d604-8565fee18251.htm
---
# Autodesk.Revit.DB.GroupTypeId.CouplerArray Property

Set.

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerArray { get; }
```